MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/SVD/STM32C542.svd
        <register>
          <name>OPAMP_TCMR</name>
          <displayName>OPAMP_TCMR</displayName>
          <description>OPAMP timer-controlled mode register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VMS_SEL</name>
              <description>OPAMP inverting input secondary selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Internal resistor divider middle point (operation as PGA)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Operational amplifier output (operation as follower)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VPS_SEL</name>
              <description>OPAMP noninverting input secondary selection.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>OPAMP_VINP0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>OPAMP_VINP1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>OPAMP_VINP2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>OPAMP_VINP3 pin or DAC output channel</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMCM_SEL</name>
              <description>Timer toggle signal selection for operational amplifier input control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>None (input configuration permanently controlled through VP_SEL[1:0] and VM_SEL)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>opamp_tc1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>opamp_tc2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>opamp_tc3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>opamp_tc4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>opamp_tc5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>opamp_tc6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>opamp_tc7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAS_GAIN</name>
              <description>Operational amplifier programmable gain and PGA flavor secondary control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>gain 2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>gain 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>gain 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>gain 16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>gain -1 / gain 2 with bias on OPAMP_VINM0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>gain -3 / gain 4 with bias on OPAMP_VINM0</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xA</name>
                  <description>gain -7 / gain 8 with bias on OPAMP_VINM0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>gain -15 / gain 16 with bias on OPAMP_VINM0</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x10</name>
                  <description>gain 2 with filtering on OPAMP_VINM0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x11</name>
                  <description>gain 4 with filtering on OPAMP_VINM0</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x12</name>
                  <description>gain 8 with filtering on OPAMP_VINM0</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x13</name>
                  <description>gain 16 with filtering on OPAMP_VINM0</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x18</name>
                  <description>gain -1 / gain 2 with bias on OPAMP_VINM0 and filtering on OPAMP_VINM1</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x19</name>
                  <description>gain -3 / gain 4 with bias on OPAMP_VINM0 and filtering on OPAMP_VINM1</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1A</name>
                  <description>gain -7 / gain 8 with bias on OPAMP_VINM0 and filtering on OPAMP_VINM1</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1B</name>
                  <description>gain -15 / gain of 16 with bias on OPAMP_VINM0 and filtering on OPAMP_VINM1</description>
                  <value>0x1B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMPGA_SEL</name>
              <description>Timer toggle signal selection for programmable gain control</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>None (gain permanently controlled through PGA_GAIN[4:0] and VM_SEL[1:0])</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>opamp_tp1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>opamp_tp2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>opamp_tp3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>opamp_tp4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>opamp_tp5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>opamp_tp6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>opamp_tp7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>OPAMP_TCMR register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Read-write</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Read-only (OPAMP_TCMR locked)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
